Autodesk.Revit.DB.Structure.RebarShapeMultiplanarDefinition.DepthParamId
Id of the parameter driving the multiplanar depth.
The depth is measured center-to-center of the bar.
A valid shape parameter must be assigned to DepthParamId before
the MultiplanarDefinition can be used in RebarShape creation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null